Table of Contents
 Class AnchorParam
Namespace
IdeaRS.OpenModel.Parameters
Assembly
IdeaRS.OpenModel.dll
Parameter which represts the record of the anchor in IDEA MPRL
[DataContract]
[Serializable]
public class AnchorParam : BoltParam
Inheritance
object
MprlRecord
BoltParam
AnchorParam
Inherited Members
 BoltParam.CoordinateSystem
 BoltParam.Positions
 BoltParam.Rows
 BoltParam.Cols
 BoltParam.RowsNegative
 BoltParam.ColsNegative
 BoltParam.RowsSymmetry
 BoltParam.ColsSymmetry
 BoltParam.RowsPosition
 BoltParam.ColsPosition
 BoltParam.RowsGridType
 BoltParam.ColsGridType
 BoltParam.PolarInput
 BoltParam.Counts
 BoltParam.Radii
 BoltParam.Angles
 BoltParam.PolarPosition
 BoltParam.ShearInThread
 BoltParam.BoltInteraction
 MprlRecord.Name
 MprlRecord.TableId
 MprlRecord.ItemId
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 AnchorTypeData
Gets or sets the various type of anchor.
[DataMember]
public AnchorType AnchorTypeData { get; set; }
Property Value
AnchorType
 AnchorTypeSize
Gets or sets the size of washer plate.
[DataMember]
public double AnchorTypeSize { get; set; }
Property Value
double
 Length
Gets or sets the anchor length.
[DataMember]
public double Length { get; set; }
Property Value
double
 Edit this page